# a = int(input())
# b = int(input())
# c = int(input())

a = 5
b = 4
c = 3
print(a, b, c)

# на примере a = 5, b = 4, c = 3
# Задача - выстроить числа по возрастанию, начинаем последовательные проверки:

# 1    a > b
if a > b:  # то меняем их местами, сейчас a = 5, b = 4
    b = a + b  # a = 5, b = 9
    a = b - a  # a = 4, b = 9
    b = b - a  # a = 4, b = 5, поменяли, теперь переходим к b - c

    # 1.1    b > c, т.е. их надо поменять местами, сейчас b = 5, c = 3
    if b > c:
        b = c + b  # b = 8, c = 3
        c = b - c  # b = 8, c = 5
        b = b - c  # b = 3, c = 5  # поменяли, теперь переходим к a - c

    # 1.2    b < c, т.е. их местами менять не надо

# 2    a < b
else:
    print(a)


#     if a < c:
#         if b < c:
#             print(a, b, c)  # т.е. числа и так по возрастанию, менять не надо
#         else:  # т.е. если b > c, то их надо поменять местами, например b =
#             # 3, c = 4
#             c = b + c  # b = 3, c = 7
#             b = c - b  # b = 4, c = 7
#             c = c - b  # b = 4, c = 3
#             print(a, b, c)
#
#     elif a > c:  # т.е. если a < c, то их надо поменять местами
#         c = a + c
#         a = c - a
#         c = c - a
#
#         if b < c:  # поменяли, теперь опять проверяем b
#             print(a, b, c)
#         else:  # т.е. если b < c
#             c = b + c
#             b = c - b
#             c = c - b
#             print(a, b, c)
# else:  # т.е. a < b, меняем их местаими
#     b = a + b
#     a = b - a
#     b = b - a
#
#     if a > c:
#         if b > c:
#             print(a, b, c)
#         else:  # т.е. если b < c, то их надо поменять местами, например b =
#             # 3, c = 4
#             c = b + c  # b = 3, c = 7
#             b = c - b  # b = 4, c = 7
#             c = c - b  # b = 4, c = 3
#             print(a, b, c)
#     elif a > c:  # т.е. если a < c, то их надо поменять местами
#         c = a + c
#         a = c - a
#         c = c - a
#
#         if b < c:  # поменяли, теперь опять проверяем b
#             print(a, b, c)
#         else:  # т.е. если b < c
#             c = b + c
#             b = c - b
#             c = c - b
#             print(a, b, c)
