v1 = int(input())
h1 = int(input())
v2 = int(input())
h2 = int(input())

# v1 = 4
# h1 = 4
# v2 = 5
# h2 = 5

# print(h2-h1)
# print(v2-v1)

# итак у нас вокруг короля есть 8 клеток, на которые он может пойти, т.е.
# есть 8 случаев, когда клетки соседние, т.е. когда надо выводить да,
# опишем все случаи, идем по часовой:

# 1) вправо т.е. во второй клетке по горизонтали больше на 1
if (h2 - h1) == 1:
    # 1.1) по диагонали вправо вверх, т.е. по вертикали тоже больше 1
    if (v2 - v1) == 1:
        print('YES')
        # print('test1')
    # 1.2) просто направо, т.е. по вертикали также
    elif (v2 - v1) == 0:
        print('YES')
        # print('test2')
    # 1.3) по диагонали вправо вниз, т.е. по вертикали меньше на 1
    elif (v2 - v1) == -1:
        print('YES')
        # print('test3')
    else:
        print('NO')
        # print('test4')
# 2) вниз или вверх, т.е. по горизионтали также
elif(h2 - h1) == 0:
    # 2.1) вниз, т.е. по вертикали меньше
    if (v2 - v1) == -1:
        print('YES')
        # print('test5')
    # 2.2) вверх, т.е. по вертикали больше
    elif (v2 - v1) == 1:
        print('YES')
        # print('test6')
    else:
        print('NO')
        # print('test7')

# 3) влево, т.е. во второй клетке по горизонтали меньше, чем в первой
elif(h2 - h1) == -1:
    # 3.1) по диагонали налево вниз, т.е. по вертикали тоже меньше
    if (v2 - v1) == -1:
        print('YES')
        # print('test8')
    # 3.2) просто налево
    elif (v2 - v1) == 0:
        print('YES')
        # print('test9')
    # 3.3) по диагонали налево вверх, т.е.  по вертикали тоже больше
    elif (v2 - v1) == 1:
        print('YES')
        # print('test10')
    else:
        print('NO')
        # print('test11')

# во всех остальных случаях NO
else:
    print('NO')
    # print('test finish else')
